InformationRegisters/абс_ЗначенияСвойствНоменклатурыКонтрагентов/абс_ЗначенияСвойствНоменклатурыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ЗначенияСвойствНоменклатурыКонтрагентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеСвойства</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <comment>(Общ)</comment>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CommonModules/лео_ДопФункции/Module.bsl
//запрос по регистру абс_ЗначенияСвойствНоменклатурыКонтрагентов
Функция Получить_ЗначениеСвойствНоменклатурыКонтрагентов(Дата, Номенклатура, Контрагент, Свойство) Экспорт 
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	абс_ЗначенияСвойствНоменклатурыКонтрагентов.ЗначениеСвойства КАК ЗначениеСвойства
	            	 	|ИЗ
	            	 	|	РегистрСведений.абс_ЗначенияСвойствНоменклатурыКонтрагентов КАК абс_ЗначенияСвойствНоменклатурыКонтрагентов
	            	 	|ГДЕ
	            	 	|	абс_ЗначенияСвойствНоменклатурыКонтрагентов.Номенклатура = &Номенклатура
	            	 	|	И абс_ЗначенияСвойствНоменклатурыКонтрагентов.Контрагент = &Контрагент
	            	 	|	И абс_ЗначенияСвойствНоменклатурыКонтрагентов.Свойство = &Свойство
	            	 	|	И абс_ЗначенияСвойствНоменклатурыКонтрагентов.Активность
	            	 	|
	            	 	|УПОРЯДОЧИТЬ ПО
	            	 	|	абс_ЗначенияСвойствНоменклатурыКонтрагентов.Период УБЫВ";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Свойство",Свойство);
	
	Выборка	=	Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначениеСвойства;
	КонецЕсли;
	Возврат "";
КонецФункции

//Запрос на получение штрихкода
Функция Получить_ШтрихКод(Номенклатура, ТипШтрихКода, ЕдиницаИзмерения, Качество) Экспорт
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	Штрихкоды.Штрихкод КАК ШтрихКод
	            	 	|ИЗ
	            	 	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	            	 	|ГДЕ
	            	 	|	Штрихкоды.Владелец = &Номенклатура
	            	 	|	И Штрихкоды.ТипШтрихкода = &ТипШтрихКода
	            	 	|	И Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения
	            	 	|	И Штрихкоды.Качество = &Качество";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ТипШтрихКода",ТипШтрихКода);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Качество",Качество);
	
	Выборка	=	Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ШтрихКод;
	КонецЕсли;
	Возврат "";
КонецФункции	

//Запрос РегистрСведений.ЗначенияСвойствОбъектов
//Объект	- объект поиска
//Свойство	- свойство объект поиска
Функция Получить_ЗначенияСвойствОбъектов(Объект,Свойство) Экспорт
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	ЗначенияСвойствОбъектов.Значение КАК Значение
	            	 	|ИЗ
	            	 	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	            	 	|ГДЕ
	            	 	|	ЗначенияСвойствОбъектов.Объект = &Объект
	            	 	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Объект",Объект);
	Запрос.УстановитьПараметр("Свойство",Свойство);
	
	Выборка	=	Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	Возврат "";
КонецФункции

//Запрос РегистрСведений.КатегорииОбъектов
Функция Получить_ЗначенияКатегорииОбъектов(Объект, Свойство) Экспорт
	Если Объект = Неопределено Тогда// Объект не указан
	   	Возврат Ложь;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект) Тогда // Объект не указан
	   	Возврат Ложь;
	КонецЕсли;
	Если ТипЗнч(Свойство) = Тип("СправочникСсылка.КатегорииОбъектов") Тогда
	   	ТребСвойство = Свойство;
	Иначе
	    ТребСвойство = Справочники.КатегорииОбъектов.НайтиПоНаименованию(Свойство);
	    Если Не ЗначениеЗаполнено(ТребСвойство) Тогда
	   	     Возврат Ложь;
	    КонецЕсли;
	КонецЕсли;
	КатОбъект=РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
	КатОбъект.Отбор.Объект.Значение=Объект;
	КатОбъект.Отбор.Объект.Использование = Истина;
	КатОбъект.Отбор.Категория.Значение=ТребСвойство;
	КатОбъект.Отбор.Категория.Использование = Истина;
	КатОбъект.Прочитать();
	Возврат КатОбъект.Количество()=1; 								// Истина=Категория имелось, Ложь=Категории нет	
КонецФункции	
	
//Получить ед.измерения
Функция Получить_ЕдиницуИзмерения(Номенклатура, ЕдИзм_ПоКлассификатору) Экспорт
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	ЕдиницыИзмерения.Ссылка
	            	 	|ИЗ
	            	 	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	            	 	|ГДЕ
	            	 	|	ЕдиницыИзмерения.Владелец = &Номенклатура
	            	 	|	И ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдИзм_ПоКлассификатору";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ЕдИзм_ПоКлассификатору", ЕдИзм_ПоКлассификатору);
	
	Выборка	=	Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();	
КонецФункции

//По заданию Сан Саныча
//Заполнение хоз операций
Функция ЗаполнитьХозяйственнуюОперациюПоДоговору(ДокумОбъект) Экспорт
	Если ДокумОбъект.Контрагент=Справочники.Контрагенты.НайтиПоКоду("К00001098") ИЛИ 
		 ДокумОбъект.Контрагент=Справочники.Контрагенты.НайтиПоКоду("К00000893") ИЛИ 
		 ДокумОбъект.Контрагент=Справочники.Контрагенты.НайтиПоКоду("К00001149") Тогда
		Возврат Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000049");
	ИначеЕсли ДокумОбъект.Контрагент=Справочники.Контрагенты.НайтиПоКоду("УТ0005805") И Найти(ВРег(ДокумОбъект.ДоговорКонтрагента.Наименование), "УВЕДОМЛЕНИЕ О ВЫКУПЕ")>0 Тогда
		Возврат  Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000130");
	ИначеЕсли ДокумОбъект.Контрагент=Справочники.Контрагенты.НайтиПоКоду("ККК003794") И Найти(ВРег(ДокумОбъект.ДоговорКонтрагента.Наименование), ВРег("Отчет о выкупленных товарах"))>0 Тогда
		Возврат  Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000130");
	ИначеЕсли ДокумОбъект.Контрагент=Справочники.Контрагенты.НайтиПоКоду("ККК003794") И ДокумОбъект.ДоговорКонтрагента=Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УТ023356") Тогда
		Возврат  Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000131");
	ИначеЕсли ДокумОбъект.Контрагент=Справочники.Контрагенты.НайтиПоКоду("К00003119") Тогда    
		Возврат  Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000030");
	ИначеЕсли ДокумОбъект.ДоговорКонтрагента.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда    
		Возврат  Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000017");
	ИначеЕсли ДокумОбъект.ДоговорКонтрагента.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда    
		Возврат  Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("3");
	Иначе
		Возврат ДокумОбъект.абс_ХозяйственнаяОперация;
	КонецЕсли;	
КонецФункции

//получить GTIN по номенклатуре
Функция ПолучитьGTINпоНоменклатуре(Номенклатура) Экспорт
	Запрос 	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	Штрихкоды.Штрихкод КАК Штрихкод
	            	 	|ИЗ
	            	 	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	            	 	|ГДЕ
	            	 	|	Штрихкоды.Владелец = &Номенклатура
	            	 	|	И Штрихкоды.ТипШтрихкода = &GTIN
	            	 	|	И Штрихкоды.Качество = &Качество
	            	 	|	И Штрихкоды.ЕдиницаИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("GTIN",ПланыВидовХарактеристик.ТипыШтрихкодов.НайтиПоКоду("00000000006"));
	Запрос.УстановитьПараметр("Качество",Справочники.Качество.Новый);
	Запрос.УстановитьПараметр("ЕдиницаПоКлассификатору",Номенклатура.БазоваяЕдиницаИзмерения);
	Выборка	=	Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.Штрихкод);
	КонецЕсли;	
	//если не нашли штрих код Новый, тогда смотрим без качества
	Запрос 	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	Штрихкоды.Штрихкод КАК Штрихкод
	            	 	|ИЗ
	            	 	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	            	 	|ГДЕ
	            	 	|	Штрихкоды.Владелец = &Номенклатура
	            	 	|	И Штрихкоды.ТипШтрихкода = &GTIN
	            	 	|	И Штрихкоды.ЕдиницаИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("GTIN",ПланыВидовХарактеристик.ТипыШтрихкодов.НайтиПоКоду("00000000006"));
	Запрос.УстановитьПараметр("ЕдиницаПоКлассификатору",Номенклатура.БазоваяЕдиницаИзмерения);
	Выборка	=	Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.Штрихкод);
	КонецЕсли;	
	Возврат "--------------";
КонецФункции	

//получить ОСГ из спецификации
Функция ПолучитьОСГ_Номенклатура_Спецификация(Номенклатура, Спецификация) Экспорт
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	СпецификацииНоменклатурыИсходныеКомплектующие.Лео_МинПроцентОСГ КАК МинПроцОСГ
	            	 	|ИЗ
	            	 	|	Справочник.СпецификацииНоменклатуры.ИсходныеКомплектующие КАК СпецификацииНоменклатурыИсходныеКомплектующие
	            	 	|ГДЕ
	            	 	|	СпецификацииНоменклатурыИсходныеКомплектующие.Ссылка = &Спецификация
	            	 	|	И СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Спецификация", Спецификация); 
	Выборка	=	Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МинПроцОСГ;
	КонецЕсли;
	Возврат 0;
КонецФункции

Функция ВозвратТаблицыКодовКИЗ_Коробки(ДокументОтгрузки,Номенклатура) Экспорт
	Отбор	=	Новый Структура;
	Отбор.Вставить("Номенклатура",Номенклатура);
	
	ТЧСписокКоробок	=	ДокументОтгрузки.СписокКоробок.Выгрузить();
	КопияТаб		=	ТЧСписокКоробок.Скопировать(Отбор);
	Возврат КопияТаб;
КонецФункции

Функция ВозвратТаблицыКодовКИЗ_Штуки(ДокументОтгрузки,Номенклатура) Экспорт
	Отбор	=	Новый Структура;
	Отбор.Вставить("Номенклатура",Номенклатура);   
	
	ТЧСписокКоробок	=	ДокументОтгрузки.ШтучныеQR_Коды.Выгрузить();
	КопияТаб		=	ТЧСписокКоробок.Скопировать(Отбор);
	Возврат КопияТаб;
КонецФункции

Функция ПодготовкаСтрокиДляПередачиXML(СтрокаДО) Экспорт
	//Символы, которые необходимо экранировать (заменить на сущности): 
	//< (меньше): Заменяется на &lt;
	//> (больше): Заменяется на &gt;
	//& (амперсанд): Заменяется на &amp;
	//" (двойные кавычки): Заменяется на &quot;
	//' (апостроф): Заменяется на &apos;	

    СтрокаПосле	=	СтрЗаменить(СтрокаДО,	"<","&lt;");
    СтрокаПосле	=	СтрЗаменить(СтрокаПосле,">","&gt;");
    СтрокаПосле	=	СтрЗаменить(СтрокаПосле,"&","&amp;");
    СтрокаПосле	=	СтрЗаменить(СтрокаПосле,Символ(34),"&quot;");
    СтрокаПосле	=	СтрЗаменить(СтрокаПосле,"'","&apos");

	Возврат СтрокаПосле;
КонецФункции
